Repository: flow03/CoM-Archolos-Ukrainian-Translation
Catalog: DialogeOmegaT/omegat/project_save.tmx
Source language: pl
Languages: uk

source: Może jeszcze mi powiesz, że robisz to ze zwykłej dobroci serca?
uk: Може ще скажеш, що робиш це по доброті душевній?

source: Może już ktoś go wykopał? To z pewnością te wieśniaki z winnicy! Musieli tu węszyć i pewnie któryś natrafił na skarb.
uk: Може, хтось його вже викопав? Це точно були ті селюки з виноградника! Вони, мабуть, нишпорили тут і хтось з них випадково натрапив на скарб.

source: Może karczma Helgi?
uk: Може, до корчми Хельги?

source: Może kiedy indziej.
uk: Можливо, іншим разом.

source: Może kiedyś sam zostaniesz ojcem i zobaczysz, jak ciężkim zadaniem jest odpowiednie wychowanie potomstwa.
uk: Якщо колись ти сам станеш батьком, то побачиш, як це важко - правильно виховувати дітей.

source: Może kilka siniaków ją upiększy?
uk: Може, кілька синців її прикрасять?

source: Może ktoś inny otruł Stana?
uk: Можливо, хтось інший отруїв Стена?

source: Może ktoś inny pójdzie?
uk: Може, хтось інший піде?

source: Może ktoś sobie robi żarty... pewnie to ten sam drań, który rozwalił beczkę za moim domem!
uk: Може, це хтось пожартував... Напевно, це той покидьок, який розбив бочку за моїм будинком!

source: Może ktoś taki jak PISARZ?
uk: Можливо, хтось на кшталт ПИСАРЯ?

source: Może lepiej ja będę mówił, co?
uk: Може краще я буду говорити?

source: Może lepiej przetestuj tę miksturę.
uk: Може, краще протестуй цю мікстуру.

source: Może lepiej przetestuj tę miksturę. Ponoć umożliwia ona oddychanie pod wodą.
uk: Може, краще протестуй цю мікстуру. Кажуть, вона дозволяє дихати під водою.

source: Może lepiej tego nie próbować...
uk: Мабуть, їх краще не пробувати...

source: Może lepiej, żebyś to ty się tym zajął.
uk: Мабуть, буде краще, якщо ти сам придумаєш назву.

source: Może liczyć na moją pomoc.
uk: Він може розраховувати на мою допомогу.

source: Może mają tam jakiś rozbity obóz? Lepsze to niż bycie przeganianym przez straż.
uk: Може, вони там розбили табір? Все ж краще, ніж бути прогнаними вартовими.

source: Może mają tam jakiś rozbity obóz? Lepsze to, niż bycie przeganianym przez straż.
uk: Може, вони там розбили табір? Все ж краще, ніж бути прогнаними вартовими.

source: Może mam zatańczyć i zaśpiewać?
uk: Може, я маю станцювати і заспівати?

source: Może mam, a może nie mam. Co cię to obchodzi?
uk: Може, так, а, може, й ні. Яка тобі різниця?

source: Może masz rację. Zostanę tu i rozejrzę w poszukiwaniu kolejnych wskazówek co do reszty hersztów.
uk: Можливо, ти маєш рацію. Я залишуся тут і роздивлюся довкола, щоб знайти більше підказок про решту вождів.

source: Może masz rację...
uk: Можливо, ти маєш рацію...

source: Może masz rację... Gdy tak to ująłeś, to robi to więcej sensu.
uk: Можливо, ти маєш рацію... Коли ти так кажеш, це має якийсь сенс.

source: Może miał dostać złoto po śmierci Holdwiga?
uk: Можливо, йому мали заплатити лише після смерті Гольдвіга?

source: Może miałabym zamiatać dom jakiegoś obleśnego bogacza, który będzie mnie szczypał w tyłek za plecami żony, co?
uk: Можливо, мені довелося б підмітати будинок якогось огидного багатія, який щипав би мене за дупу за спиною у дружини, хіба ні?

source: Może mogę ci jakoś z tym pomóc?
uk: Може, я зможу якось з цим допомогти?

source: Może mogę jakoś pomóc?
uk: Можливо, я можу чимось допомогти?

source: Może mogę wam się na coś przydać?
uk: Можливо, я можу бути вам корисним?

source: Może moim błędem od samego początku było zawierzenie w moc natury? Pozwoliłem, by to ścierwojady trawiły moje cenne rośliny, gdy proces ten powinien mieć miejsce u jakiegoś innego gatunku. Muszę się tylko zastanowić, co będzie odpowiednie...
uk: Можливо, моєю помилкою від самого початку була довіра до сил природи? Я дозволив, щоб саме падальники перетравлювали мої дорогоцінні рослини, тоді як цей процес мав би відбутися у якихось інших видів. Мені залишається тільки обдумати, у яких саме...

source: Może mógłbym ci jakoś pomóc?
uk: Може, я можу тобі чимось допомогти?

source: Może mógłbym ci pomóc wrócić do dawnego fachu?
uk: Можливо, я міг би допомогти тобі повернутися до твого ремесла?

source: Może mógłbym ci pomóc?
uk: Може, я міг би допомогти тобі?

source: Może mógłbym coś dla ciebie zrobić?
uk: Можливо, я можу щось для тебе зробити?

source: Może mógłbym jakoś pomóc?
uk: Можливо, я можу чимось допомогти?

source: Może mógłbym poszukać kogoś, kto by cię zastąpił?
uk: Можливо, мені варто пошукати когось на заміну?

source: Może mógłbym sprawdzić, co się z nim dzieje.
uk: Може, я міг би з'ясувати, що з ним сталося.

source: Może mógłbym zdobyć dla ciebie nowe mięso?
uk: Може, я міг би дістати для тебе нове м'ясо?

source: Może mógłbym zostać? Obiecuję, że nie drgnę z miejsca, dopóki nie powiesz, że skończyłeś.
uk: Можна мені залишитися? Обіцяю не рухатись, поки не закінчиш.

source: Może mógłbyś mnie poratować jakimś piwem? Pewnie masz tam jeszcze kilka w zanadrzu...
uk: Може ти зможеш пригостити мене якимось пивом? Мабуть, там у тебе ще є кілька пляшок...

source: Może mógłbyś nauczyć mnie czegoś o walce, co?
uk: Може, ти міг би навчити мене, як треба битися?

source: Może na wilki?
uk: Може, для вовків?

source: Może napijesz się ze mną?
uk: Може, вип'єш зі мною?

source: Może naprawić problemy ze stabilnością gry.
uk: Це може виправити проблеми зі стабільністю гри.

source: Może nawet wciąż tkwi w jego ciele, ale na wyjęcie go jest już trochę za późno.
uk: Можливо, він й досі в його тілі, але діставати його вже трохи запізно.

source: Może nawet widziałem gościa, o którego pytasz, ale czy to coś zmienia?
uk: Можливо, я навіть бачив хлопця, про якого ти питаєш, але хіба це щось змінює?

source: Może nie będzie tak źle...
uk: Можливо, все буде не так вже й погано...

source: Może nie jest to figurka, ale na drewnie trochę się znam.
uk: Можливо, не в статуетках, але в деревині я трохи розуміюся.

source: Może nie ma tu żadnych zabieganych mieszczuchów, ale to całe robactwo mnie wykończy.
uk: Може, тут і немає метушливих містян, але всі ці паразити мене просто вбивають.

source: Może nie mam na stanie tylu broni co Odgar, ale u mnie zawsze, powtarzam: ZAWSZE, znajdziesz najwyższą jakość!
uk: Можливо, у мене не так багато зброї, як у Одгара, але у мене завжди, повторюю: ЗАВЖДИ, знайдеться зброя найвищої якості!

source: Może nie poszło mi najlepiej pod słońcem, ale wykonałem zadanie. Cortez będzie teraz musiał rozwiązać problem dostaw, ale to już nie moje zmartwienie.
uk: Можливо, я зробив не все можливе, але я виконав своє завдання. Тепер Кортезу доведеться вирішувати проблему з нестачею провізії, але це вже не моя турбота.

source: Może nie radzi sobie z zapanowaniem nad tymi wszystkimi górnikami? Tak czy inaczej, nie możemy sobie teraz pozwolić na straty w tak istotnej inwestycji jak kopalnia.
uk: Може, він не може тримати усіх гірників під контролем? У будь-якому випадку, ми не можемо собі зараз дозволити втратити таку важливу інвестицію як копальня.

source: Może nie są to jego dokładne słowa, ale chyba to miał na myśli.
uk: Можливо, це не його точні слова, але я думаю, що він мав на увазі саме це.

source: Może nie wspominała, ale długi trzeba spłacać. Dawaj to złoto, bo nie mam całego dnia!
uk: Може й не згадувала, але борги треба віддавати. Віддай мені це золото, бо я не можу чекати весь день!

source: Może niepotrzebnie ci wspomniałem o moich przemyśleniach. Nie mamy pojęcia, co to mogło być.
uk: Можливо, я дарма поділився з тобою своїми здогадками. Ми навіть не знаємо, що це було насправді.

source: Może od niego uda ci się dowiedzieć czegoś więcej.
uk: Можливо, тобі вдасться дізнатися від нього більше.

source: Może od początku nie chodziło o to, żeby pozbyć się handlarzy, tylko o to, by sprzedawane posążki były poświęcone?
uk: Можливо, від самого початку йшлося не про те, щоб позбутися торговців, а про те, щоб продані статуетки були освячені?

source: Może ojciec w końcu zrozumiał, że nie zamierzam pracować w stoczni, budując okręty dla ciemiężycieli tej wyspy.
uk: Можливо, мій батько нарешті зрозумів, що я не збираюся працювати у корабельні, будуючи кораблі для гнобителів цього острова.

source: Może on będzie coś wiedział.
uk: Може, він щось знає.

source: Może opowiem ci chociaż, co udało mi się do tej pory odkryć?
uk: Може, я хоча б розкажу про те, що мені вже вдалося дізнатися?

source: Może otwiera drzwi w jego domu?
uk: Може, він відчиняє двері в його будинку?

source: Może parę monet cię przekona?
uk: Можливо, кілька монет переконають тебе?

source: Może parę monet odświeży ci pamięć?
uk: Може, кілька монет освіжать твою пам'ять?

source: Może po prostu był zamachowcem i szaleńcem w jednym. Nie wziąłeś tego pod uwagę?
uk: Можливо, він просто напросто вбивця і божевільний водночас. Ти не думав про це?

source: Może po prostu obija się jak zwykle albo zagryzły go jakieś dzikie bestie.
uk: Може, просто блукає, як завжди, або його загризли якісь дикі звірі.

source: Może po prostu poszukałbym dla ciebie tych ziół, a ty zapomniałbyś o całej sprawie?
uk: Може, я просто пошукаю ті трави для тебе, а ти забудеш про все це?

source: Może po prostu poszukałbym dla ciebie tych ziół?
uk: Може, я просто пошукаю ті трави для тебе?

source: Może po prostu zawęża klientelę?
uk: Може, він просто звужує коло клієнтів?

source: Może po prostu zwietrzył okazję, by mnie okraść? Zobaczył, że wyszedłem, nie wiedział, że Jorn się u mnie zatrzymuje, a gdy wszedł do środka, było już za późno?
uk: Можливо, вони просто скористалися можливістю пограбувати мене? Побачили, як я пішов, і не знаючи, що Йорн залишився у мене, зайшли всередину, але було вже запізно?

source: Może po tym, że zakradasz się na cmentarz w środku nocy i odkopujesz tego chłopaczka?
uk: Може тому, що ти тиняєшся по цвинтарю посеред ночі і відкопуєш того хлопця?

source: Może po wszystkim, przejdziemy się razem w spokojniejsze miejsce?
uk: Можливо, після цього ми разом прогуляємося в більш спокійному місці?

source: Może pociągniesz za nią, to zobaczymy, co się stanie?
uk: Потягни за нього і подивимось, що станеться.

source: Może podpowiesz mi, kto dałby sobie radę w przeklętym grobowcu?
uk: Може підкажеш мені, хто дав би собі раду в проклятій гробниці?

source: Może pomogą mi odnaleźć brata.
uk: Може, вони допоможуть мені знайти брата.

source: Może porozmawiałbyś z nim i spróbował jakoś uspokoić sytuację? Jako że jesteś jednym z nich, to może prędzej cię wysłucha.
uk: Можливо, ти міг би поговорити з ним і спробувати якось залагодити ситуацію? Оскільки ти один із них, можливо, він прислухається до тебе.

source: Może porzucił karierę, ale w końcu był naprawdę szczęśliwy.
uk: Можливо, він і відмовився від кар'єри, але, зрештою, він був по-справжньому щасливим.

source: Może postawię ci coś lepszego?
uk: Може, пригостити тебе чимось кращим?

source: Może poszukamy go razem?
uk: Можливо, пошукаємо його разом?

source: Może posłużyć jako dowód w sprawie.
uk: Може бути використаний як доказ у справі.

source: Może powie nam więcej o broni, z jakiej strzelał zamachowiec.
uk: Можливо, він розповість нам більше про зброю, з якої стріляв убивця.

source: Może powiedz mu prawdę?
uk: Може, скажеш йому правду?

source: Może powiesz mi jakieś konkrety?
uk: Може скажеш щось більш конкретне?

source: Może powiesz mi, co się z nimi stało?
uk: Можливо, ти поясниш, що з ними сталося?

source: Może powinienem poszukać jakiegoś cyrulika? Nie wiem, kto inny mógłby mieć doświadczenie z nastawianiem kości...
uk: Можливо, мені варто звернутися до цирульника? Я не знаю, хто ще може мати досвід у вправлянні кісток...

source: Może powinieneś dorzucić mu smoczego pyłu?
uk: Можливо, варто підсипати йому драконячого пилу?

source: Może powinieneś dorzucić mu smoczego pyłu? To niezwykle ostra przyprawa, pochodząca z odległych krain. Z tego co mi wiadomo pali mocniej niż kula ognia.
uk: Можливо, варто підсипати йому трохи драконячого пилу? Це надзвичайно гостра спеція з далеких країв. Наскільки я знаю, вона пече сильніше за вогняну кулю.

source: Może powinieneś o tym powiedzieć straży?
uk: Може, тобі варто розповісти про це вартовим?

source: Może powinieneś spróbować zbożowej starki? Słyszałem, że Martha często ją sprzedaje. To z pewnością pomoże ci się odprężyć.
uk: Можливо, тобі варто спробувати зерновий туманник? Я чув, що Марта часто їх продає. Це точно допоможе тобі розслабитися.

source: Może powinieneś wyruszyć ze mną i resztą strażników?
uk: Можливо, тобі краще вирушити зі мною і рештою вартових?

source: Może powinieneś z nim porozmawiać?
uk: Можливо, тобі варто поговорити з ним?

source: Może powinniśmy ich wziąć z zaskoczenia? Strzelisz w tę tarczę, oni wtedy na nas zwrócą uwagę, a ja pobiegnę?
uk: Може, нам варто застати їх зненацька? Ти вистрілиш у мішень, вони звернуть на нас увагу, а я побіжу?

source: Może powinniśmy poinformować władze wyspy? Mogliby pomóc.
uk: Можливо, варто повідомити владу острова? Вони могли б допомогти.

source: Może powinniśmy udowodnić, że trafiamy z takiego dystansu?
uk: Можливо, варто довести, що ми можемо влучити з такої відстані?

source: Może połakomi się na mięso? Tylko musiałoby go być całkiem sporo, żeby bestia w ogóle się zainteresowała.
uk: Можливо, згодуй йому м'ясо? Тільки його має бути досить багато, щоб цей звір взагалі зацікавився.

source: Może połasi się na złoto?
uk: Може, він погодиться на золото?

source: Może przedmioty, które Dima ma przekazać tej kobiecie, są w kufrze obok straganu?
uk: Можливо, речі, які Діна має віддати цій жінці, лежать у скрині біля прилавку?

source: Może przekona cię parę monet?
uk: Може, кілька монет тебе переконають?

source: Może przeniosę się na jej miejsce, kto wie? Dokładnych planów nie mam zamiaru ci zdradzać.
uk: Може, переберуся на її місце, хто знає? Точних планів я тобі не збираюсь розкривати.

source: Może przy okazji do mojej kieszeni wpadnie parę monet?
uk: Можливо, в мою кишеню за нагоди впаде кілька монет?

source: Może przydadzą ci się te młotki?
uk: Можливо, тобі пригодяться ці молотки?

source: Może pójdziemy na współpracę?
uk: Може, розпочнемо співпрацю?

source: Może pójdę po twoją córkę?
uk: Може, мені сходити по твою доньку?

source: Może później...
uk: Може, пізніше...

source: Może płaciłeś, może nie. Znaj moje dobre serce, wejdziesz za połowę aktualnej ceny. Jeśli nie masz zamiaru płacić, to lepiej spadaj, zanim się wkurzę.
uk: Може, платив, а може, й ні. Повір моєму доброму серцю, ти пройдеш за половину поточної ціни. Якщо не збираєтеся платити, то краще забирайтеся, поки я не розсердився.

source: Może raczej byłem, bo nie poluję już zbyt często. Swoje w życiu zarobiłem. Teraz korzystam z uroków emerytury.
uk: Ну, вірніше був ним, оскільки тепер я практично не полюю. Я заробив достатньо, і тепер можу просто насолоджуватися життям.

source: Może rzeczywiście lepiej, żeby spróbowała czegoś nowego? Poza tym kobiety lubią słodycz.
uk: Можливо, їй справді краще спробувати щось нове? До того ж, жінки люблять солодке.

source: Może rzeczywiście mogę ci zaufać. Ale mam cię cały czas na oku!
uk: Схоже, тобі можна довіряти. Але я не спускатиму з тебе очей!

source: Może rzeczywiście mógłbyś mi się na coś nadać.
uk: Може, ти справді міг би щось для мене зробити.

source: Może rzeczywiście... Dobra, do zobaczenia później.
uk: Може й справді... Добре, побачимось пізніше.

source: Może sakiewka rozwiąże problem? (200 SZ)
uk: Може, гаманець вирішить цю проблему? (200 золотих)

source: Może się dogadamy?
uk: Можливо, ми зможемо домовитися?

source: Może się jakoś dogadamy?
uk: Може, ми якось домовимось?

source: Może się jakoś dogadamy? (łapówka)
uk: Може, ми якось домовимось? (Дати хабар)

source: Może się jakoś dogadamy? Łażenie nocą po mieście pewnie nie należy do twoich ulubionych zajęć. Może moglibyśmy opłacić ci krótką wizytę w karczmie?
uk: Може, ми якось знайдемо спільну мову? Блукати нічним містом, мабуть, не одне з твоїх улюблених занять. Можливо, ми могли б завітати до якоїсь корчми?

source: Może się jeszcze kiedyś spotkamy, to znowu ci coś zaśpiewam.
uk: Можливо, ми ще колись зустрінемося, і я знову тобі щось заспіваю.

source: Może skusisz się na coś do picia?
uk: Хочеш чогось випити?

source: Może skusisz się na coś do picia? (Daj piwo)
uk: Може, хочеш чогось випити? (Дати пиво)

source: Może sprawdzimy ostatnie miejsce?
uk: Як щодо того, щоб перевірити останнє місце?

source: Może sprawdzimy, co z opatrunkiem dla Jorna?
uk: Може, перевіримо, що там з пов'язкою для Йорна?

source: Może sprawdzimy, kto jest lepszym strzelcem?
uk: Може, перевіримо, хто влучніший стрілець?

source: Może spróbujemy rozwiesić jakieś ogłoszenia o tym, kogo poszukujemy?
uk: Чому б нам не спробувати розклеїти оголошення про зникнення?

source: Może spróbuję ją odzyskać?
uk: А якщо я спробую його повернути?

source: Może strażnicy poszli pozbyć się właśnie tej Bestii?
uk: Можливо, вартові пішли розібратися з цим самим Звіром?

source: Może strażnicy rozglądają się za bagiennym zielem?
uk: Можливо, вартові шукають болотну траву?

source: Może strażnicy rozglądają się za pewną skrzynią z bagiennym zielem?
uk: Можливо, вартові шукають якусь скриню з болотною травою?

source: Może tak, a może nie.
uk: Може так, а може й ні.

source: Może tak, może nie.
uk: Може так, а може й ні.

source: Może tam ludzie nie będą takimi ciotami, jak tutaj.
uk: Може, хоч там люди не будуть такими тюхтіями, як тут.

source: Może tam spróbuj szczęścia?
uk: Може, пошукаєш щастя там?

source: Może tam w zwężeniu jaskini?
uk: Може, там, у вузькому проході печери?

source: Może tego nie wiesz, ale budowa miasta Archolos zaczęła się właśnie od Starego Miasta.
uk: Можливо, ти цього не знав, але будівництво міста Архолос розпочалося зі Старого міста.

source: Może ten leń posłucha kogoś w swoim wieku! Jeszcze go dzisiaj nie widziałem, więc pewnie dalej śpi w domku dla pracowników. To ten mały budynek na wzgórzu.
uk: Може, цей ледар прислухається до когось свого віку! Сьогодні я його ще не бачив, тож, напевно, він досі спить у будиночку для працівників. Це маленька будівля на пагорбі.

source: Może ten pierścień należał do jednego z porywaczy?
uk: Може, цей перстень належав одному з викрадачів?

source: Może ten posterunek faktycznie jest źle umiejscowiony?
uk: Можливо, цей пост і справді розміщено невдало?

source: Może teraz gońcy będą liczyli sobie mniej złota za dostawy z wioski...
uk: Може, тепер посланці братимуть менше золота за доставку з села...

source: Może teraz się skusisz na jeden łyczek?
uk: Може, ще є бажання зробити один ковточок?

source: Może teraz zaczniesz traktować innych z szacunkiem.
uk: Може, тепер ти почнеш ставитися до інших з повагою.

source: Może też mógłbym coś zdobyć?
uk: Можливо, я теж зможу щось дістати?

source: Może to było tylko echo, ale słyszałem też jakieś podejrzane odgłosy. Jeśli zamierzasz to sprawdzić, to zalecam ostrożność.
uk: Можливо, це було просто відлуння, але я також чув якісь підозрілі звуки. Якщо ти збираєшся їх перевірити, я б рекомендував бути обережним.

source: Może to część większego spisku? Może Magowie w ten sposób chcą nas kontrolować? Mieć pieczę nad nami?
uk: Може, це частина великої змови? Можливо, маги хочуть таким чином контролювати нас? Мати над нами владу?

source: Może to dziwny pomysł...
uk: Можливо, це дивна ідея...

source: Może to i była dobra rozgrzewka, ale skąd wiesz, że już jesteśmy bezpieczni?
uk: Можливо, це була гарна розминка, але звідки ти знаєш, що ми вже в безпеці?

source: Może to i dobrze?
uk: Може, це й добре?

source: Może to i lepiej, przynajmniej nie przeszkadza mi w prowadzeniu tego miejsca dokładnie tak, jak mi się podoba.
uk: Можливо, це й на краще. Принаймні, він не заважає мені керувати крамницею так, як мені подобається.

source: Może to i lepiej.
uk: Можливо, це на краще.

source: Może to i lepiej...
uk: Може, це й на краще...

source: Może to i lepiej? Cieszę się, nie widząc strażników dyktujących co wolno, a czego nie.
uk: Може, це й на краще? Я рада, що не бачу вартових, які вказують, що можна, а що ні.

source: Może to jakiś nieudany eksperyment? Sam nie wiem...
uk: Може, це якийсь невдалий експеримент? Сам не знаю...

source: Może to jest miejsce, którego szukasz?
uk: Може, це саме те місце, яке ти шукаєш?

source: Może to jest sposób? Broddy nie może się najeść czerstwym chlebem, a Salvi nie pozwala mu się objadać. Gdybym przygotował jakieś smaczne danie, to istnieje szansa, że wartownik opuści swój posterunek. Oby Berto miał coś, z czego można ugotować coś smacznego.
uk: Можливо, це і є вихід? Бродді не подобається черствий хліб, а Сальві більше нічого йому не дає. Якщо я приготую якусь смачну страву, є шанс, що вартовий залишить свій пост. Будемо сподіватися, що у Берто є з чого приготувати щось смачненьке.

source: Może to jest właśnie ten znak, na który czekasz?
uk: Може, це і є той самий знак, на який ти чекав?

source: Może to któryś z tych przestępców?
uk: Можливо, це один з тих злочинців?

source: Może to mały kroczek, ale zawsze do przodu!
uk: Нехай це маленький крок, але він завжди веде вперед!

source: Może to pomoże ci je rozwiać.
uk: Можливо, це допоможе їх розвіяти.

source: Może to prawda, może i nie. Pozwól, że zaoferuję ci pewien układ.
uk: Може, це правда, а може й ні. Дозволь запропонувати тобі угоду.

source: Może to rozwieje twoje wątpliwości?
uk: Може, це розвіє твої підозри?

source: Może to rozwieje twoje wątpliwości? (Zapłać 100 SZ)
uk: Може, це розвіє твої підозри? (Заплатити 100 золотих)

source: Może to sam Adanos skierował nas tutaj, byśmy uratowali go przed własną magią.
uk: Можливо, сам Аданос спрямував нас сюди, щоб врятувати його від власної магії.

source: Może to ta sama Bestia co w Silbach?
uk: Може, це той самий Звір, що і в Сільбаху?

source: Może to te przeklęte ulotki rozprowadzane ostatnio po mieście mieszają ludziom w głowach na tyle, że zaczęli dopuszczać się aktów wandalizmu.
uk: Можливо, це ті кляті листівки, які поширилися останнім часом по місту, настільки збентежили людей, що вони почали вчиняти акти вандалізму.

source: Może to tylko zbieg okoliczności?
uk: Можливо, це просто збіг обставин?

source: Może to w tej klatce była przetrzymywana Bestia z Archolos?
uk: Можливо, в цій клітці утримували Звіра з Архолосу?

source: Może tobie uda się coś z niego wyciągnąć.
uk: Можливо, тобі вдасться щось з нього витягнути.

source: Może trochę bimbru? Ale ostrzegam, jest cholernie mocny!
uk: Я маю трохи самогону. Але попереджаю, він до біса міцний!

source: Może trochę spuścisz z ceny?
uk: Може, трохи знизиш ціну?

source: Może ty byłbyś w stanie przemówić mu do rozsądku? Prędzej posłucha kogoś w podobnym wieku, niż starego wiekiem przełożonego.
uk: Можливо, ти міг би вплинути на нього? Він скоріше послухає когось із ровесників, ніж старшого керівника.

source: Może ty coś wiesz o złotych Innosach?
uk: Може, ти щось знаєш про золотих Інносів?

source: Może ty dasz radę go odszyfrować.
uk: Можливо, ти зможеш її розшифрувати.

source: Może ty je naprawisz?
uk: Чому б тобі не полагодити їх?

source: Może ty mi powiesz czy faktycznie nie jest smaczna?
uk: Може, ти мені скажеш, чи він справді не смачний?

source: Może ty mi powiesz, gdzie powinienem iść?
uk: Не підкажеш, як мені туди дістатися?

source: Może ty mógłbyś się rozejrzeć po farmie, popytać ludzi.
uk: Може, ти міг би роздивитися довкола ферми, розпитати людей.

source: Może tym razem uda mi się cokolwiek złowić.
uk: Може, цього разу мені вдасться щось спіймати.

source: Może tym razem zaproponujesz coś mniej bagnistego?
uk: Можливо, цього разу ти запропонуєш щось менш болотисте?

source: Może uda ci się przymknąć na to oko...
uk: Може ти заплющиш на це очі...

source: Może uda mi się dobić dobrego targu.
uk: Можливо, мені вдасться укласти вигідну угоду.

source: Może uda mi się jeszcze czegoś dowiedzieć...
uk: Можливо, вдасться ще щось довідатися...
